# target: ~/Brewfile

tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "teamookla/speedtest"

brew "autojump"
brew "bat"
brew "coreutils"
brew "ctags-exuberant"
brew "deno"
brew "exa"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "gpg2"
brew "htop"
brew "hub"
brew "jq"
brew "neovim"
brew "python3"
brew "ripgrep"
brew "speedtest"
brew "starship"
brew "the_silver_searcher"
brew "tmate"
brew "tmux"
brew "tree"
brew "watch"
brew "wget"

# ----------
# -- CASK --
# ----------
cask "1password"
cask "adobe-acrobat-reader"
cask "alfred"

# INSTALL FAILING
# cask "authy"
# cask "calibre"
# cask "google-chrome"
# cask "skype"

cask "alacritty"
cask "arq"
cask "charles"
cask "docker"
cask "dropbox"
cask "figma"
cask "firefox"
cask "font-fira-code-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "github"
cask "graphql-playground"
cask "istat-menus"
cask "kitty"
cask "microsoft-edge"
cask "ngrok"
cask "now"
cask "postgres"
cask "postman"
cask "protonmail-bridge"
cask "rectangle"
cask "signal"
cask "slack"
cask "spotify"
cask "steam"
cask "typora"
cask "visual-studio-code"
cask "whatsapp"

# ============================
# ============================
# ============================

tap "heroku/brew"
brew "heroku"

# brew "certbot"
# brew "dep"
# brew "elixir"
# brew "exercism"
# brew "go"
# brew "kubectl"
# brew "pwgen"
# brew "scala"
# brew "ssh-copy-id"
# brew "vegeta"
# brew "yarn"

# cask "altair"
# cask "atom"
# cask "caskroom/versions/firefox-developer-edition"
# cask "cycling74-max"
# cask "discord"
# cask "gemini"
# cask "google-backup-and-sync"
# cask "google-chrome-canary"
# cask "gpg-suite"
# cask "graphiql"
# cask "hyper"
# cask "imazing"
# cask "intel-power-gadget"
# cask "intellij-idea-ce"
# cask "iterm2"
# cask "kap"
# cask "kibana"
# cask "macdown"
# cask "notion"
# cask "postgres"
# cask "postico"
# cask "r-app"
# cask "rstudio"
# cask "sequel-pro"
# cask "sourcetree"
# cask "suspicious-package"
# cask "tableplus"
# cask "teamviewer"
# cask "virtualbox"
# cask "vlc"
