# target: ~/Brewfile

tap "homebrew/core"
tap "homebrew/bundle"

tap "teamookla/speedtest"
brew "speedtest"

brew "autojump"
brew "bat"
brew "coreutils"
brew "ctags-exuberant"
brew "deno"
brew "exa"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "golang"
brew "gpg2"
brew "htop"
brew "jq"
brew "neovim"
brew "python3"
brew "ripgrep"
brew "starship"
brew "tree"
brew "watch"
brew "wget"

# ----------
# -- CASK --
# ----------
tap "homebrew/cask-fonts"
cask "font-fira-code-nerd-font"
cask "font-sauce-code-pro-nerd-font"

cask "adobe-acrobat-reader"
cask "alacritty"
cask "arq"
cask "docker"
cask "dropbox"
cask "figma"
cask "firefox"
cask "github"
cask "graphql-playground"
cask "istat-menus"
cask "microsoft-edge"
cask "ngrok"
cask "postman"
cask "rectangle"
cask "spotify"
cask "visual-studio-code"

# === Disabled ===
# cask "1password"
# cask "authy"
# cask "calibre"
# cask "google-chrome"
# cask "now"
# cask "protonmail-bridge"
# cask "skype"
# cask "slack"
